In [43]:
import pandas as pd
import numpy as np

In [44]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 1. Display Top 3 Rows of the Dataset

In [7]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

## 2.Check Last 3 Rows of The Dataset

In [11]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 3. Find Shape of Our Dataset (Number of Rows & Number of Columns)

In [12]:
df1.shape

(7, 3)

In [13]:
print(f"Number Of Rows {df1.shape[0]}")
print(f"Number of Columns {df1.shape[1]}")

Number Of Rows 7
Number of Columns 3

## 4. Get Information About Our Dataset Like Total Number Rows , Total Number of Columns, Datatypes of Each Column and memory Requirement

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

## 5. Check Null Values In the Dataset

In [17]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [18]:
df1.isnull().sum(axis=1) # row wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [19]:
df1.isnull().sum(axis=0) # column wise

Name      0
Marks     0
Gender    0
dtype: int64

## 6. Get Overall Statistics About Dataframe

In [21]:
# why only it showed Marks column ,because describe method only shows columns with numerical data
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [22]:
df1.describe(include= 'all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

## 7. Find Unique Values From The Gender Column

In [23]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [24]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## 8. Find the Number of Unique values from the Gender column

In [25]:
df1['Gender'].nunique()

2

## 9. Display Count of Unique Values in Gender Column

In [26]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

## 10. Find Total of Students Having Marks Between 90 To 100 (inclusive) Using Between Method

In [31]:
df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [32]:
df1['Marks'] >= 90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [33]:
df1[df1['Marks'] >= 90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [35]:
(df1['Marks'] >=90) & (df1['Marks']<=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [36]:
df1[(df1['Marks'] >=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [37]:
len(df1[(df1['Marks'] >=90) & (df1['Marks']<=100)])

4

In [38]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [40]:
sum(df1['Marks'].between(90,100))

4

## 11. Find Average Marks

In [41]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [45]:
df1['Marks'].mean()

np.float64(92.14285714285714)

In [48]:
# also we can have the Max the Min
df1['Marks'].max()

np.int64(99)

## 12. Apply Method

In [54]:
def marks(x):
    return x//2

In [50]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [55]:
# we can put these new data in a new column 
df1['Half_marks'] = df1['Marks'].apply(marks)

In [56]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [57]:
# Lambda function with Apply
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [59]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## 13. Map Function

In [60]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [61]:
df1['Gender'].map({"Male":1,"Female":0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [62]:
df1['Male_Female'] = df1['Gender'].map({"Male":1,"Female":0}) # For encoding purpose

In [63]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

## 14. Drop the Column(s)

In [64]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [66]:
df1.drop('Male_Female',axis = 1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [71]:
# if i want to drop multiple columns
df1.drop(['Male_Female','Half_marks'],axis = 1, inplace= True) #

## 15. Prit Name of Columns

In [72]:
df1.columns 
# it is not an method it is an attribute of pandas data frame

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [73]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## 16. Sort The Dataframe As Per The Marks Column

In [74]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [77]:
# asc order
df1.sort_values(by='Marks')

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [78]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [79]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## 17. Display Name & Marks of The Female Students

In [80]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [81]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [82]:
df1['Gender'] == 'Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [86]:
df1[df1['Gender'] == 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [87]:
df1['Gender'].isin(['Female'])

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [89]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99